## Map function 
Map values of Series using input correspondence (which can be a dict, Series, or function)

In [55]:
import pandas as pd
import numpy as np

In [56]:
data = pd.read_csv('data/train.csv')

In [57]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [58]:
# let's convert 1 and 0 from sex column
data["Sex_Num"] = data.Sex.map({'female':0,'male':1})

In [59]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_Num
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [60]:
data.loc[0:4, ["Sex", "Sex_Num"]]

      Sex  Sex_Num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [61]:
# let's get the mean fare price using map function
data["mean_fare"] = data.Fare.map(lambda x: np.mean(x)a)

SyntaxError: invalid syntax (<ipython-input-61-1f1b0ba25dd8>, line 2)

In [62]:
data.loc[0:3, ["Fare","mean_fare"]]

      Fare  mean_fare
0   7.2500        NaN
1  71.2833        NaN
2   7.9250        NaN
3  53.1000        NaN

In [63]:
data["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [64]:
data["Dummy_Embarked"] = data.Embarked.map({'S':0,'C':1,'Q':3,None:4})

In [65]:
data.loc[0:4, ['Embarked','Dummy_Embarked']]

  Embarked  Dummy_Embarked
0        S               0
1        C               1
2        S               0
3        S               0
4        S               0